In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
df=pd.read_csv("C:/Users/manda/OneDrive/Desktop/data- linear regression.csv")

In [10]:
from sklearn.preprocessing import StandardScaler

In [58]:
df.sample()
x=df.drop(['Salary'],axis=1)
y=df[["Salary"]]

In [59]:
df

    qualification  experience  previous exp  Salary
0               0           1             5   23500
1               0           3             2   24500
2               0           5             6   32500
3               0           8             4   36500
4               0           4             2   26500
5               0           6             2   30500
6               0           6             6   34500
7               0           7             4   34500
8               0           8            10   42500
9               0           5             2   28500
10              0           3             5   27500
11              0           2             3   23500
12              0           4             4   28500
13              0           6             2   30500
14              1           1             5   73000
15              1           3             2   73000
16              1           5             6   87000
17              1           8             4   92000
18              1           4             5   82000
19              1           6             3   84000
20              1           6             4   86000
21              1           7             4   89000
22              1           8            10  104000
23              1           5             2   79000
24              1           3             5   79000
25              1           2             3   72000
26              1           4             4   80000
27              1           6             2   82000
28              1           6             2   82000

In [60]:
sc=StandardScaler()
x=sc.fit_transform(x)
y=sc.fit_transform(y)

SVM MODEL

In [61]:
from sklearn.svm import SVR
reg=SVR(kernel="rbf")

In [62]:
reg.fit(x,y)

C:\Users\manda\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

SVR()

In [63]:
y_pred=reg.predict([[0,6,2]])

In [64]:
y_pred

array([-0.00725696])

In [65]:
# plt.scatter(x,y)